In [3]:
import pandas as pd 
import numpy as np

In [4]:
s1 = pd.Series(np.arange(4), index = ["a","c","d","e"])
s2 = pd.Series(np.arange(5), index = ["a","c","e","f","g"])

In [5]:
s1

a    0
c    1
d    2
e    3
dtype: int32

In [6]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [7]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [8]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3),
                   columns = list("ABC"),
                  index = ["ali","efe"])
df2 = pd.DataFrame(np.arange(9).reshape(3,3),
                  columns = list("ACD"),
                  index = ["ali","can","efe"])

In [9]:
df1

     A  B  C
ali  0  1  2
efe  3  4  5

In [10]:
df2

     A  C  D
ali  0  1  2
can  3  4  5
efe  6  7  8

In [11]:
df1+df2

       A   B     C   D
ali  0.0 NaN   3.0 NaN
can  NaN NaN   NaN NaN
efe  9.0 NaN  12.0 NaN

In [12]:
#aritmetik işlem yaparken indexleri uyuşmayan değerler boş değer(NaN) olduğundan onlara 0 gibi özel bir değer atayabiliriz.
df1.add(df2,fill_value =0)

       A    B     C    D
ali  0.0  1.0   3.0  2.0
can  3.0  NaN   4.0  5.0
efe  9.0  4.0  12.0  8.0

In [13]:
1/df1

            A     B    C
ali       inf  1.00  0.5
efe  0.333333  0.25  0.2

In [14]:
#ÖZEL İŞLEMLER ;
#Ekleme methodu için .add
#Çıkarma işlemi için .sub
#Bölme işlemi için .div
#Çarpma işlemi için .mul
#Üst alma için .pow

In [15]:
df1*3 #bu komut df1.mul(3) böylede yazılabilir.

     A   B   C
ali  0   3   6
efe  9  12  15

In [16]:
df2

     A  C  D
ali  0  1  2
can  3  4  5
efe  6  7  8

In [18]:
s = df2.iloc[1] #Satırlar ili ilgili işlem yaptık.
s

A    3
C    4
D    5
Name: can, dtype: int32

In [19]:
df2-s

     A  C  D
ali -3 -3 -3
can  0  0  0
efe  3  3  3

In [20]:
s2 = df2["A"]
s2

ali    0
can    3
efe    6
Name: A, dtype: int32

In [22]:
 df2.sub(s2,axis ="index") #df2 nin sutunlarından s2 nin sutunları çıkartılmış oldu.

     A  C  D
ali  0  1  2
can  0  1  2
efe  0  1  2

In [23]:
#BİR FONKSİYONU UYGULAMAK;
vs = pd.DataFrame(np.random.randn(4,3),columns = list("ABC"),
                 index = ["ali","berk","can","efe"])
vs

             A         B         C
ali  -1.043934 -1.529044 -0.699658
berk -0.593719 -0.741506 -0.103487
can   0.094052  0.030612 -0.873455
efe  -1.425463 -0.166852 -0.282356

In [25]:
np.abs(vs) #mutlak değer alır

             A         B         C
ali   1.043934  1.529044  0.699658
berk  0.593719  0.741506  0.103487
can   0.094052  0.030612  0.873455
efe   1.425463  0.166852  0.282356

In [26]:
#fonksiyon oyugulaman için apply methodu kullanılır.

In [27]:
f = lambda x:x.max()-x.min() #sutunların max ve min değerleri arasında farkını hesaplayan bir kod.

In [28]:
vs.apply(f)

A    1.519515
B    1.559656
C    0.769968
dtype: float64

In [29]:
#her bir satıra bu fonksiyonu uygulamak istersek axis = columns veya axis = 1 yazılır.

In [30]:
vs.apply(f,axis = 1)

ali     0.829387
berk    0.638019
can     0.967506
efe     1.258612
dtype: float64

In [31]:
def f(x): #kendi yazdığımız fonksda veri setine uygulayabiliriz.
    return x**2 #veri setindeki her bir elemanın karesi alınmış oldu.

In [32]:
vs.apply(f)

             A         B         C
ali   1.089798  2.337976  0.489521
berk  0.352502  0.549831  0.010709
can   0.008846  0.000937  0.762923
efe   2.031946  0.027839  0.079725